index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-24 Tue 21:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Welcome To Akash Gopinath's Website</title>
<meta name="author" content="Akash Gopinath" />
<meta name="description" content="Official Site of Akash Gopinath, Math Student" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Welcome To Akash Gopinath&rsquo;s Website</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgafec26d">Home</a></li>
<li><a href="#orgaaf9c7d">Course Notes</a>
<ul>
<li><a href="#org7c6ccf5">First Year</a></li>
<li><a href="#org98a1468">Second Year</a>
<ul>
<li><a href="#org50b09ce">Semester 1</a></li>
<li><a href="#orga615652">Semester 2</a></li>
</ul>
</li>
<li><a href="#orgf0f4137">Third Year</a>
<ul>
<li><a href="#org584b2c7">Semester 1</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgafec26d" class="outline-2">
<h2 id="orgafec26d">Home</h2>
<div class="outline-text-2" id="text-orgafec26d">
<p>
Welcome to my webspace. My name is Akash Gopinath. I am a second year math student studying the <a href="https://www.york.ac.uk/study/undergraduate/courses/mmath-mathematics/">MMath Mathematics</a> integrated masters degree at degree at University of York.
</p>


<p>
This website is mainly for personal use and serves as a hub for storing and hosting my mathematics notes, CV etc and for me to experiment more with org mode. This website is not likely going to contain anything of interest to the general audience.
</p>
</div>
</div>
<div id="outline-container-orgaaf9c7d" class="outline-2">
<h2 id="orgaaf9c7d">Course Notes</h2>
<div class="outline-text-2" id="text-orgaaf9c7d">
<p>
This section contains links to the various courses I have taken throughout my degree. There will be section that are incomplete/not added but I will complete them in due time as I polish my notes more and more. Further just because I have not uploaded notes does not mean I do not have notes, I will upload them once I am able to perfect them.
</p>

<p>
Further I will add more and more course notes as I complete my notes on them so this is <b>NOT an exhaustive list</b> of all the courses I have taken.
</p>

<p>
These are not official notes provided by the university and there might be some mistakes. If the reader finds any please email me at <a href="mailto:ag1884@york.ac.uk">ag1884@york.ac.uk</a>
</p>
</div>
<div id="outline-container-org7c6ccf5" class="outline-3">
<h3 id="org7c6ccf5">First Year</h3>
<div class="outline-text-3" id="text-org7c6ccf5">
<ul class="org-ul">
<li><a href="./ips.html">Introduction to Probability and Statistics</a></li>
<li>Calculus</li>
<li><a href="./algebra.html">Algebra</a> (Complex Numbers, Number Theory, Vectors, Polynomials and Basic Linear Algebra)</li>
<li>Real Analysis</li>
<li><a href="./iam.html">Introduction to Applied Mathematics</a></li>
<li>Set Theory, Logic, Group Theory and Relations</li>
</ul>
</div>
</div>
<div id="outline-container-org98a1468" class="outline-3">
<h3 id="org98a1468">Second Year</h3>
<div class="outline-text-3" id="text-org98a1468">
</div>
<div id="outline-container-org50b09ce" class="outline-4">
<h4 id="org50b09ce">Semester 1</h4>
<div class="outline-text-4" id="text-org50b09ce">
<ul class="org-ul">
<li><a href="./metric-spaces.html">Metric Spaces</a></li>
<li><a href="./classical-dynamics.html">Classical Dynamics</a></li>
<li>Vector and Complex Calculus</li>
</ul>
</div>
</div>
<div id="outline-container-orga615652" class="outline-4">
<h4 id="orga615652">Semester 2</h4>
<div class="outline-text-4" id="text-orga615652">
<ul class="org-ul">
<li><a href="./abstract_algebra.html">Abstract Algebra (Groups, Rigs and Fields)</a></li>
<li><a href="./quantum_continuum.html">Quantum and Continuum Dynamics</a></li>
<li><a href="./linear-algebra.html">Linear Algebra</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf0f4137" class="outline-3">
<h3 id="orgf0f4137">Third Year</h3>
<div class="outline-text-3" id="text-orgf0f4137">
</div>
<div id="outline-container-org584b2c7" class="outline-4">
<h4 id="org584b2c7">Semester 1</h4>
<div class="outline-text-4" id="text-org584b2c7">
<ul class="org-ul">
<li><a href="./group_actions_galois.html">Group Actions and Galois Theory</a></li>
<li>Measure Theory and Integration</li>
<li>Point Set Topology and Algebraic Topology</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Akash Gopinath</p>
<p class="date">Created: 2024-12-24 Tue 21:46</p>
</div>
</body>
</html>
